## Customer Mapping

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('./dataset/customer_mapping_data.csv')
df.head()

   account  amount  month_id
0  3127143   270.0     31553
1  4413248  1280.0     31553
2  4942722   850.0     31553
3  5519726   360.0     31553
4  9197174    80.0     31553

In [3]:
pivot_df = df.pivot_table(index='account', columns='month_id', values= 'amount', aggfunc=lambda x: 1, fill_value=0).reset_index()
pivot_df['sequence'] = pivot_df.drop(columns='account').astype(str).agg(''.join, axis=1)
pivot_df

month_id  account  31552  31553  31554  31555  31556 sequence
0         3127143      1      1      1      1      1    11111
1         4413248      1      1      1      1      1    11111
2         4942722      1      1      1      0      1    11101
3         5519726      1      1      1      1      1    11111
4         9197174      1      1      0      1      1    11011
5         9907844      0      1      1      1      1    01111


### Customer mapping based on latest n months from the current month

In [4]:
def customer_mapping(df, current_month, no_of_months):
    latest_months = sorted([i for i in df['month_id'].unique() if i <= current_month], reverse=True)[:no_of_months]
    latest_df = df[df['month_id'].isin(latest_months)]
    pivot_df = latest_df.pivot_table(index='account', columns='month_id', values= 'amount', aggfunc=lambda x: 1, fill_value=0).reset_index()
    pivot_df['sequence'] = pivot_df.drop(columns='account').astype(str).agg(''.join, axis=1)
    return pivot_df[['account', 'sequence']]

In [5]:
customer_mapping(df, current_month=31555, no_of_months=3)

month_id  account sequence
0         3127143      111
1         4413248      111
2         4942722      110
3         5519726      111
4         9197174      101
5         9907844      111